Repository: chiscake/baaz-cmms
Catalog: BAAZ.CMMS.App/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# App_Title
source: BAAZ CMMS
ru_ru: БААЗ АС ТОиР

# App_TitleBar
source: BAAZ CMMS
ru_ru: БААЗ АС ТОиР

# Nav_Home
source: Home
ru_ru: Главная

# Nav_Equipment
source: Asset registry
ru_ru: Реестр объектов

# Nav_Personnel
source: Personnel management
ru_ru: Управление персоналом

# Nav_Users
source: Users
ru_ru: Пользователи

# Nav_MaintenanceSchedule
source: Maintenance schedule
ru_ru: График ППР

# Nav_IncomingRequests
source: Requests
ru_ru: Заявки

# Nav_WorkReports
source: Work reports
ru_ru: Отчёты о работах

# Nav_NewRequest
source: New request
ru_ru: Новая заявка

# Nav_MyRequests
source: My requests
ru_ru: Мои заявки

# Nav_AllRequests
source: All requests
ru_ru: Все заявки

# Nav_RequestHistory
source: Request history
ru_ru: История заявок

# Nav_RequesterAssets
source: Equipment
ru_ru: Оборудование

# RequesterAssets_Search_Placeholder
source: Search by number, name, or location
ru_ru: Поиск по номеру, названию или месту

# RequesterAssets_Empty_List
source: No active equipment available.
ru_ru: Нет доступного оборудования в эксплуатации.

# RequesterAssets_Empty_Filter
source: No matches. Try a different search.
ru_ru: Ничего не найдено. Измените поисковый запрос.

# Nav_Locations
source: Locations
ru_ru: Локации

# Nav_RepairDepartments
source: Repair departments
ru_ru: Отделы ремонта

# Nav_MaintenanceNorms
source: Maintenance norms
ru_ru: Нормативы ТО

# Nav_MaterialRequisition
source: Consumables requisition
ru_ru: Заявка на расходники

# Nav_ToolRequisition
source: Tool requisition
ru_ru: Заявка на инструмент

# Nav_ToolRequisitionHistory
source: Tool requisitions
ru_ru: Заявки на инструменты

# Nav_Group_Dispatcher
source: Dispatcher
ru_ru: Диспетчер

# Nav_Group_Requester
source: Requester
ru_ru: Заявитель

# Stub_MyRequests_Planned
source: List of requests created by the current user, with filtering by status, date and type. Available actions: view details, cancel (UC-R2, UC-R3).
ru_ru: Здесь будет список заявок, созданных текущим пользователем, с фильтрацией по статусу, дате и типу. Доступны действия: просмотр детали, отмена заявки (UC-R2, UC-R3).

# Stub_IncomingRequests_Planned
source: All incoming requests from requesters and ToolTracker, with filtering and sorting. Dispatcher can accept, reject, or assign a technician (UC-D1, UC-D2).
ru_ru: Здесь будет список всех входящих заявок от заявителей и ToolTracker с фильтрацией и сортировкой. Диспетчер может принять, отклонить или назначить исполнителя (UC-D1, UC-D2).

# IncomingRequests_Tab_New
source: New
ru_ru: Новые

# IncomingRequests_Tab_Active
source: In progress
ru_ru: В работе

# IncomingRequests_Tab_Completed
source: Completed
ru_ru: Завершённые

# IncomingRequests_Column_Accepted
source: Accepted
ru_ru: Принятые

# IncomingRequests_Column_InProgress
source: In progress
ru_ru: В работе

# IncomingRequests_Column_Completed
source: Completed
ru_ru: Выполнены

# IncomingRequests_Column_Empty
source: No requests.
ru_ru: Нет заявок.

# IncomingRequests_Action_Accept
source: Accept
ru_ru: Принять

# IncomingRequests_Action_Reject
source: Reject
ru_ru: Отклонить

# IncomingRequests_Action_Open
source: Open
ru_ru: Открыть

# IncomingRequests_Empty
source: No requests in this tab.
ru_ru: Нет заявок в этой вкладке.

# IncomingRequests_Error_Action
source: Failed to perform the action. Please try again.
ru_ru: Не удалось выполнить действие. Попробуйте ещё раз.

# IncomingRequests_Confirm_Reject_Title
source: Reject request
ru_ru: Отклонить заявку

# IncomingRequests_Confirm_Reject_Placeholder
source: Enter a reason for rejection
ru_ru: Укажите причину отклонения

# Request_Assignee_None
source: No technician assigned
ru_ru: Техник не назначен

# Stub_RequestDetail_Title
source: Request details
ru_ru: Детали заявки

# Stub_RequestDetail_Planned
source: Full request info: status, assignee, status history log. Role-based actions: cancel (requester), assign/start (dispatcher), accept (requester/dispatcher), view log (UC-R3, UC-R4, UC-D2, UC-D6).
ru_ru: Полная информация о заявке: статус, исполнитель, история изменений. Доступны действия в зависимости от роли: отмена (заявитель), назначение/запуск (диспетчер), приёмка (заявитель/диспетчер), просмотр лога (UC-R3, UC-R4, UC-D2, UC-D6).

# RequestDetail_Title
source: Request
ru_ru: Заявка

# RequestDetail_Label_Requester
source: Requester
ru_ru: Заявитель

# RequestDetail_Section_Departments
source: Involved departments
ru_ru: Задействованные отделы

# RequestDetail_Section_Actions
source: Actions
ru_ru: Действия

# RequestDetail_Section_WorkReports
source: Work reports
ru_ru: Отчёты о работах

# RequestDetail_Action_AssignTechnician
source: Assign technician
ru_ru: Назначить техника

# RequestDetail_Action_StartWork
source: Start work
ru_ru: Начать работы

# RequestDetail_Action_ConfirmInventoryReceived
source: Instrument received
ru_ru: Инструмент получен

# RequestDetail_Label_InventoryWarehouse
source: TMS warehouse
ru_ru: Склад TMS

# RequestDetail_Label_InventoryHandoff
source: Handoff mode
ru_ru: Способ передачи

# RequestDetail_Label_InventoryReceivedAt
source: Received by department
ru_ru: Получен отделом

# RequestDetail_Handoff_Pickup
source: Department picks up at warehouse
ru_ru: Отдел заберёт со склада

# RequestDetail_Handoff_Deliver
source: Storekeeper delivers to department
ru_ru: Кладовщик передаст в отдел

# RequestDetail_Hint_AwaitingClerkHandoff
source: Awaiting storekeeper handoff in TMS (warehouse → department).
ru_ru: Ожидает передачи кладовщиком TMS на склад → отдел.

# RequestDetail_Action_ChangeZone
source: Repair zone
ru_ru: Зона ремонта

# RequestDetail_Action_Apply
source: Change
ru_ru: Сменить

# RequestDetail_Action_TransferDepartment
source: Transfer to another department
ru_ru: Передать в другой отдел

# RequestDetail_Action_AddDepartment
source: Add department
ru_ru: Подключить отдел

# RequestDetail_Action_SubmitWorkReport
source: Submit work report
ru_ru: Внести отчёт о работах

# RequestDetail_Action_CloseRequest
source: Close request
ru_ru: Закрыть заявку

# RequestDetail_ContractorName_Placeholder
source: Acme Repair LLC, tax ID…
ru_ru: ООО «Ремонт», ИНН…

# RequestDetail_WorkPerformed_Label
source: Work performed
ru_ru: Выполненные работы

# RequestDetail_WorkPerformed_Placeholder
source: Describe work done, replaced components, and operations…
ru_ru: Опишите выполненные работы, заменённые узлы и операции…

# RequestDetail_Duration_Label
source: Duration, hours
ru_ru: Затраченное время, ч

# RequestDetail_PartsUsed_Label
source: Parts used
ru_ru: Использованные запчасти

# RequestDetail_PartsUsed_Placeholder
source: List items separated by commas or on new lines
ru_ru: Перечень через запятую или с новой строки

# RequestDetail_DefectsFound_Label
source: Defects found
ru_ru: Обнаруженные дефекты

# RequestDetail_DefectsFound_Placeholder
source: Leave empty if no defects were found
ru_ru: Если дефектов нет — оставьте пустым

# RequestDetail_Notes_Label
source: Notes
ru_ru: Примечания

# RequestDetail_Notes_Placeholder
source: Additional information for records
ru_ru: Дополнительная информация для учёта

# RequestDetail_AssignedTechnician_Label
source: Technician
ru_ru: Исполнитель

# RequestDetail_WorkReport_Department_Label
source: Department
ru_ru: Отдел

# RequestDetail_WorkReports_Empty
source: No work reports yet.
ru_ru: Отчётов о работах пока нет.

# RequestDetail_Error_Action
source: Failed to perform the action. Please try again.
ru_ru: Не удалось выполнить действие. Попробуйте ещё раз.

# RequestDetail_Error_RepairZoneRequired
source: Select a repair zone.
ru_ru: Выберите зону ремонта.

# RequestDetail_Error_NotInPreparation
source: This action is only available during preparation (status Accepted).
ru_ru: Действие доступно только на этапе подготовки (статус «Принята»).

# RequestDetail_Error_DepartmentAlreadyReported
source: This department has already submitted a work report — changes are not allowed.
ru_ru: Отдел уже сдал отчёт о работах — изменения недоступны.

# RequestDetail_Error_NotAccepted
source: Work can only be started for an accepted request.
ru_ru: Начать работы можно только для принятой заявки.

# RequestDetail_Error_AllDepartmentsNeedAssignee
source: Assign a technician in every involved department before starting work.
ru_ru: Назначьте исполнителя в каждом подключённом отделе перед запуском работ.

# RequestDetail_Error_NotAssignable
source: This action is not available in the current request status.
ru_ru: Действие недоступно в текущем статусе заявки.

# RequestDetail_Banner_DepartmentReported
source: Your department's work report has been submitted. Wait for completion or close the request when status is Completed.
ru_ru: Отчёт по вашему отделу сдан. Ожидайте завершения заявки или закройте её после статуса «Выполнена».

# RequestDetail_Actions_Empty
source: No actions available for the current status.
ru_ru: Нет доступных действий для текущего статуса.

# RequestDetail_Confirm_Transfer_Title
source: Transfer the request to another department?
ru_ru: Передать заявку в другой отдел?

# RequestDetail_Confirm_Transfer_Message
source: Your department will lose access to this request. This action cannot be undone.
ru_ru: Ваш отдел потеряет доступ к заявке. Действие нельзя отменить.

# Stub_MaintenanceSchedule_Planned
source: Planned maintenance schedule: list of items per asset with TO-1, TO-2, KR dates. Dispatcher views overdue and upcoming items, can cancel or reschedule (UC-D3, UC-D5).
ru_ru: График планово-предупредительных ремонтов: список позиций по оборудованию с датами ТО-1, ТО-2, КР. Диспетчер видит просроченные и предстоящие позиции, может отменить или перенести (UC-D3, UC-D5).

# Stub_WorkReports_Planned
source: Work report registry: list of reports with actual duration, technician, and link to request or PPM item. Dispatcher creates a report after completing work (UC-D4).
ru_ru: Реестр отчётов о выполненных работах: список отчётов с фактическим временем, исполнителем и привязкой к заявке или позиции ППР. Диспетчер создаёт отчёт после завершения работ (UC-D4).

# Stub_MaintenanceNorms_Planned
source: Maintenance interval configuration: TO-1, TO-2, KR norms per asset. Admin sets intervals in days, used to calculate the next maintenance date (UC-A5).
ru_ru: Настройка межремонтных интервалов: таблица норм ТО-1, ТО-2, КР для каждого объекта. Администратор задаёт интервалы в днях, на основе которых рассчитывается следующая дата ТО (UC-A5).

# Stub_Locations_Planned
source: Location directory: hierarchy of shops, sections, and installation sites. Admin creates and edits the enterprise structure (UC-A1).
ru_ru: Справочник локаций и мест установки оборудования: иерархия цех — участок — место. Администратор создаёт и редактирует структуру предприятия (UC-A1).

# Locations_Column_FullPath
source: Full path
ru_ru: Полный путь

# Locations_Column_Name
source: Name
ru_ru: Наименование

# Locations_Column_Code
source: Code
ru_ru: Код

# Locations_Column_Parent
source: Parent
ru_ru: Родитель

# Locations_Column_Active
source: Active
ru_ru: Активна

# Locations_Column_CreatedAt
source: Created
ru_ru: Создано

# Locations_Column_UpdatedAt
source: Updated
ru_ru: Обновлено

# Locations_Toolbar_Add
source: Add
ru_ru: Добавить

# Locations_Toolbar_Refresh
source: Refresh
ru_ru: Обновить

# Locations_Toolbar_Columns
source: Columns
ru_ru: Столбцы

# Locations_Toolbar_Archive
source: Archive branch ({0})
ru_ru: Архивировать ветку ({0})

# Locations_Toolbar_Restore
source: Restore branch ({0})
ru_ru: Восстановить ветку ({0})

# Locations_Toolbar_HardDelete
source: Delete permanently ({0})
ru_ru: Удалить навсегда ({0})

# Locations_Filter_Placeholder
source: Search by name, code, or path…
ru_ru: Поиск по названию, коду или пути…

# Locations_ShowInactive
source: Show archived
ru_ru: Показывать архивные

# LocationPicker_OpenDialog
source: Open picker…
ru_ru: Открыть выбор…

# LocationPicker_DialogTitle
source: Select location
ru_ru: Выбор локации

# LocationScopePicker_DialogTitle
source: Select request zones
ru_ru: Выбор зон заявок

# LocationPicker_SearchPlaceholder
source: Search by name…
ru_ru: Поиск по названию…

# LocationPicker_SearchNoResults
source: No matches found
ru_ru: Ничего не найдено

# LocationPicker_ClearSearch
source: Clear search
ru_ru: Очистить поиск

# LocationPicker_DialogApply
source: Select
ru_ru: Выбрать

# LocationPicker_DialogCancel
source: Cancel
ru_ru: Отмена

# LocationPicker_NotSelected
source: Not selected
ru_ru: Не выбрано

# Locations_Editor_Save
source: Save
ru_ru: Сохранить

# Locations_Editor_Cancel
source: Cancel
ru_ru: Отмена

# Locations_Editor_Name
source: Name
ru_ru: Наименование

# Locations_Editor_Code
source: Code
ru_ru: Код

# Locations_Editor_Parent
source: Parent location
ru_ru: Родительская локация

# Locations_Editor_ClearParent
source: No parent (root node)
ru_ru: Без родителя (корневой узел)

# Locations_Editor_Title_New
source: New location
ru_ru: Новая локация

# Locations_Editor_Title_Edit
source: Edit location
ru_ru: Редактирование локации

# Locations_Context_ArchiveBranch
source: Archive branch
ru_ru: Архивировать ветку

# Locations_Context_RestoreBranch
source: Restore branch
ru_ru: Восстановить ветку

# Locations_Archive_Title
source: Archive branch?
ru_ru: Архивировать ветку?

# Locations_Archive_Message
source: Location "{0}" and all its child nodes will be archived.
ru_ru: Будет архивирована локация «{0}» и все её дочерние узлы.

# Locations_Restore_Title
source: Restore branch?
ru_ru: Восстановить ветку?

# Locations_Restore_Message
source: Location "{0}" and all its child nodes will be restored.
ru_ru: Будет восстановлена локация «{0}» и все её дочерние узлы.

# Locations_ArchiveBulk_Title
source: Archive selected branches?
ru_ru: Архивировать выбранные ветки?

# Locations_ArchiveBulk_Message
source: Branches to archive: {0}.
ru_ru: Будет архивировано веток: {0}.

# Locations_RestoreBulk_Title
source: Restore selected branches?
ru_ru: Восстановить выбранные ветки?

# Locations_RestoreBulk_Message
source: Branches to restore: {0}.
ru_ru: Будет восстановлено веток: {0}.

# Locations_Delete_Title
source: Delete branch permanently?
ru_ru: Удалить ветку навсегда?

# Locations_Delete_Message
source: Location "{0}" and all its child nodes will be permanently deleted. This cannot be undone.
ru_ru: Будет безвозвратно удалена локация «{0}» и все её дочерние узлы. Это действие нельзя отменить.

# Locations_DeleteBulk_Title
source: Delete selected branches permanently?
ru_ru: Удалить выбранные ветки навсегда?

# Locations_DeleteBulk_Message
source: Branches to delete: {0}. This cannot be undone.
ru_ru: Будет безвозвратно удалено веток: {0}. Это действие нельзя отменить.

# Locations_Error_HasProfiles
source: Cannot complete: users are assigned to this location or its child nodes.
ru_ru: Невозможно выполнить операцию: к локации или её дочерним узлам привязаны пользователи.

# Locations_Error_HasAssets
source: Cannot complete: non-decommissioned assets exist in this location or its child nodes.
ru_ru: Невозможно выполнить операцию: в локации или её дочерних узлах есть не списанное оборудование.

# Locations_Validation_NameRequired
source: Enter a location name.
ru_ru: Укажите наименование локации.

# Locations_Validation_Cycle
source: A location cannot be its own parent or a descendant of itself.
ru_ru: Нельзя назначить родителем саму локацию или её дочерний узел.

# Locations_Validation_CodeDuplicate
source: A location with this code already exists.
ru_ru: Локация с таким кодом уже существует.

# RepairDepartments_Column_Name
source: Name
ru_ru: Наименование

# RepairDepartments_Column_Code
source: Code
ru_ru: Код

# RepairDepartments_Column_Active
source: Active
ru_ru: Активен

# RepairDepartments_Column_CreatedAt
source: Created
ru_ru: Создан

# RepairDepartments_Column_UpdatedAt
source: Updated
ru_ru: Обновлён

# RepairDepartments_Toolbar_Add
source: Add
ru_ru: Добавить

# RepairDepartments_Toolbar_Refresh
source: Refresh
ru_ru: Обновить

# RepairDepartments_Toolbar_Columns
source: Columns
ru_ru: Колонки

# RepairDepartments_Toolbar_Archive
source: Archive ({0})
ru_ru: Архивировать ({0})

# RepairDepartments_Toolbar_Restore
source: Restore ({0})
ru_ru: Восстановить ({0})

# RepairDepartments_Toolbar_HardDelete
source: Delete permanently ({0})
ru_ru: Удалить навсегда ({0})

# RepairDepartments_Filter_Placeholder
source: Search by name or code…
ru_ru: Поиск по названию или коду…

# RepairDepartments_ShowInactive
source: Show archived
ru_ru: Показывать архивные

# RepairDepartments_Editor_Save
source: Save
ru_ru: Сохранить

# RepairDepartments_Editor_Cancel
source: Cancel
ru_ru: Отмена

# RepairDepartments_Editor_Name
source: Name
ru_ru: Наименование

# RepairDepartments_Editor_Code
source: Code
ru_ru: Код

# RepairDepartments_Editor_Title_New
source: New repair department
ru_ru: Новый отдел ремонта

# RepairDepartments_Editor_Title_Edit
source: Edit repair department
ru_ru: Редактирование отдела ремонта

# RepairDepartments_Context_Archive
source: Archive
ru_ru: Архивировать

# RepairDepartments_Context_Restore
source: Restore
ru_ru: Восстановить

# RepairDepartments_Archive_Title
source: Archive department?
ru_ru: Архивировать отдел?

# RepairDepartments_Archive_Message
source: Department "{0}" will be hidden from selection lists. Existing links will be kept.
ru_ru: Отдел «{0}» будет скрыт из списков выбора. Существующие привязки сохранятся.

# RepairDepartments_Restore_Title
source: Restore department?
ru_ru: Восстановить отдел?

# RepairDepartments_Restore_Message
source: Department "{0}" will be available for selection again.
ru_ru: Отдел «{0}» снова станет доступен для выбора.

# RepairDepartments_ArchiveBulk_Title
source: Archive selected departments?
ru_ru: Архивировать выбранные отделы?

# RepairDepartments_ArchiveBulk_Message
source: Departments to archive: {0}.
ru_ru: Будет архивировано отделов: {0}.

# RepairDepartments_RestoreBulk_Title
source: Restore selected departments?
ru_ru: Восстановить выбранные отделы?

# RepairDepartments_RestoreBulk_Message
source: Departments to restore: {0}.
ru_ru: Будет восстановлено отделов: {0}.

# RepairDepartments_Delete_Title
source: Delete department permanently?
ru_ru: Удалить отдел навсегда?

# RepairDepartments_Delete_Message
source: Department "{0}" will be permanently deleted. This cannot be undone.
ru_ru: Будет безвозвратно удалён отдел «{0}». Это действие нельзя отменить.

# RepairDepartments_DeleteBulk_Title
source: Delete selected departments permanently?
ru_ru: Удалить выбранные отделы навсегда?

# RepairDepartments_DeleteBulk_Message
source: Departments to delete: {0}. This cannot be undone.
ru_ru: Будет безвозвратно удалено отделов: {0}. Это действие нельзя отменить.

# RepairDepartments_Error_DuplicateCode
source: A department with this code already exists.
ru_ru: Отдел с таким кодом уже существует.

# RepairDepartments_Error_InUse
source: Cannot delete department: it is referenced by requests, work reports, maintenance schedule, or dispatchers.
ru_ru: Невозможно удалить отдел: он используется в заявках, отчётах, графике ТО или привязан к диспетчеру.

# RepairDepartments_Error_HasDispatchers
source: Cannot archive department: dispatchers are assigned to it.
ru_ru: Невозможно архивировать отдел: к нему привязаны диспетчеры.

# RepairDepartments_Error_HasActiveRequests
source: Cannot archive department: there are active requests routed to it.
ru_ru: Невозможно архивировать отдел: есть активные заявки с этим отделом в маршрутизации.

# RepairDepartments_Validation_NameRequired
source: Enter the department name.
ru_ru: Укажите наименование отдела.

# Stub_Users_Planned
source: User account registry: list of users with roles (admin, dispatcher, requester). Admin changes roles and profile data (UC-A2).
ru_ru: Реестр учётных записей: список пользователей с ролями (admin, dispatcher, requester). Администратор изменяет роли и данные профилей (UC-A2).

# Stub_MaterialRequisition_Planned
source: Consumables and spare parts requisition form: link to request or PPM item, technician, line items. Sent to warehouse system (UC-D7).
ru_ru: Форма заявки на выдачу расходных материалов и запчастей со склада: привязка к заявке или ППР, исполнитель, перечень позиций. Передаётся в складскую систему (UC-D7).

# DocumentSave_PickerTitle
source: Save material requisition
ru_ru: Сохранить заявку на ТМЦ

# DocumentSave_FileTypeLabel
source: Word document
ru_ru: Документ Word

# MaterialRequisition_Section_WorkOrder
source: Work order
ru_ru: Наряд

# MaterialRequisition_Section_Warehouse
source: Issuing warehouse
ru_ru: Склад-отправитель

# MaterialRequisition_Section_Lines
source: Line items
ru_ru: Позиции

# MaterialRequisition_Section_Lines_Hint
source: Enter a name and quantity for each line. SKU and line note are optional.
ru_ru: Укажите наименование и количество для каждой позиции. Артикул и примечание — по желанию.

# MaterialRequisition_Section_Notes
source: Notes
ru_ru: Примечания

# MaterialRequisition_Label_WorkOrderKind
source: Work order type
ru_ru: Тип наряда

# MaterialRequisition_Label_WorkOrder
source: Work order
ru_ru: Наряд

# MaterialRequisition_Label_Technician
source: Technician
ru_ru: Исполнитель

# MaterialRequisition_Label_WarehouseName
source: Warehouse name
ru_ru: Наименование склада

# MaterialRequisition_Line_Name
source: Name
ru_ru: Наименование

# MaterialRequisition_Line_Sku
source: SKU / code
ru_ru: Артикул / код

# MaterialRequisition_Line_Quantity
source: Quantity
ru_ru: Количество

# MaterialRequisition_Line_Unit
source: Unit
ru_ru: Ед. изм.

# MaterialRequisition_Line_LineNote
source: Line note
ru_ru: Примечание к позиции

# MaterialRequisition_Line_ItemTitle
source: Item
ru_ru: Позиция

# MaterialRequisition_Line_Name_Placeholder
source: e.g. engine oil 5W-40
ru_ru: Например: масло моторное 5W-40

# MaterialRequisition_Line_Sku_Placeholder
source: Optional
ru_ru: Необязательно

# MaterialRequisition_Line_Unit_Placeholder
source: pcs, kg, L…
ru_ru: шт, кг, л…

# MaterialRequisition_Line_LineNote_Placeholder
source: Optional
ru_ru: Необязательно

# MaterialRequisition_Action_AddLine
source: Add line
ru_ru: Добавить позицию

# MaterialRequisition_Action_RemoveLine
source: Remove
ru_ru: Удалить

# MaterialRequisition_Notes_Placeholder
source: Additional notes for the warehouse (optional)
ru_ru: Дополнительные сведения для склада (необязательно)

# MaterialRequisition_Default_WarehouseName
source: Central warehouse
ru_ru: Центральный склад

# MaterialRequisition_Kind_Request
source: Repair request
ru_ru: Заявка на ремонт

# MaterialRequisition_Kind_Schedule
source: Planned maintenance (PPM)
ru_ru: Плановое ТО (ППР)

# MaterialRequisition_Context_Request
source: Request: {0}. Assigned technician: {1}.
ru_ru: Заявка: {0}. Исполнитель по наряду: {1}.

# MaterialRequisition_Submit_Success_Title
source: Requisition created
ru_ru: Заявка сформирована

# MaterialRequisition_Submit_Success_Message
source: File saved: {0} Open the document?
ru_ru: Файл сохранён: {0} Открыть документ?

# MaterialRequisition_Error_NoWorkOrder
source: Select a work order (request or PPM entry).
ru_ru: Выберите наряд (заявку или ППР).

# MaterialRequisition_Error_NoTechnician
source: Select a technician.
ru_ru: Выберите исполнителя.

# MaterialRequisition_Error_NoWarehouse
source: Enter the issuing warehouse.
ru_ru: Укажите склад-отправитель.

# MaterialRequisition_Error_NoLines
source: Add at least one line item.
ru_ru: Добавьте хотя бы одну позицию.

# MaterialRequisition_Error_InvalidQuantity
source: Enter a name and quantity greater than zero for each line.
ru_ru: Укажите наименование и количество больше нуля для каждой позиции.

# MaterialRequisition_Error_WorkOrderNotFound
source: Work order not found or not accessible.
ru_ru: Наряд не найден или недоступен.
